app/controllers/cards_controller.rb

INSERT INTO "cards" ("company", "created_at", "first_name", "home_phone", "last_name", "personal", "updated_at", "work_email", "work_phone") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @card = Card.new(params.require(:card).permit(:first_name, :last_name, :company, :work_phone, :work_email, :home_phone, :personal))
    if @card.save